<?php
/**
 * Массив сообщений об ошибках.
 * Прописанные в этом массиве сообщения всегда доступны, но их нельзя изменять через админку
 *
 * @example $messages[module][key][message] = new_message
 * @var array
 */
$messages = array(
//	'db' => array(
//		'default' => '',//Введены ошибочные данные',
//		'common' => array(
//			'NO_INNODB' => 'В указанной системе управления базами данных (MySQL) не поддерживаются таблицы типа "InnoDB".'.
//							'Обратитесь к администратору хостинга или настройте MySQL самостоятельно'
//		),
//		'database' => array(
//			'MIN' => 'Введите имя для базы данных',
//			'MAX' => 'Слишком длинное имя базы даных',
//			'TYPE' => 'Недопустимое имя для базы данных',
//			'NO_ACCESS' => 'Нет прав доступа, либо указанной базы не существует и нет прав для её создания',
//			'BD_NO_EMPTY' => 'Указанная база данных уже содержит таблицы, выберите другую или очистите её вручную'
//		),
//		'user' => array(
//			'MIN' => 'Введите имя пользователя',
//			'MAX' => 'Слишком длинное имя пользователя',
//			'NO_ACCESS' => 'Неверное имя пользователя (или пароль)'
//		),
//		'passw'  => array(
//			'NO_ACCESS' => 'Неверный пароль (или имя пользователя)'
//		),
//		'host'  => array(
//			'MIN' => 'Введите адрес сервера MySQL',
//			'MAX' => 'Слишком длинный адрес сервера',
//			'NOT_FOUND' => 'Указанный сервер не найден'
//		),
//		'port' => 'Неверный номер порта',
//		'pfx' => array(
//			'SAFE_NAME' => 'Недопустимый префикс для таблиц. Используйте латинские символы',
//			'MAX' => 'Слишком длинный префикс для таблиц'
//		)
//	),
//
//	'auth' => array(
//		'name' => array(
//			'MIN' => 'Введите имя',
//			'MAX' => 'Слишком длинное имя пользоателя'
//		),
//		'passw' => array(
//			'MIN' => 'Слишком короткий пароль',
//			'MAX' => 'Слишком длинный пароль'
//		),
//		'passw_retry' => array(
//			'MIN' => 'Введите повторно пароль',
//			'MAX' => 'Слишком длинный пароль',
//			'BAD_REPLY_PASSWORD' => 'Повторно введенный пароль не совпадает с первым вводом'
//		),
//		'email' => array(
//			'MIN' => 'Введите e-mail адрес',
//			'MAX' => 'Недопустимо длинный e-mail адрес',
//			'TYPE' => 'Неверный e-mail адрес'
//		)
//	),
//	'project' => array(
//		'admin_email' => array(
//			'MIN' => 'Введите e-mail адрес',
//			'MAX' => 'Недопустимо длинный e-mail адрес',
//			'TYPE' => 'Неверный e-mail адрес'
//		)
//	),
//	'file' => array(
//		'to' => array(
//			'NOT_VALID_FILE_EXT' => 'Не поддерживаемый тип файла'
//		)
//	)
);
